app/controllers/posts_controller.rb

  def index
    @authors = Author.all

    if !params[:author].blank?
      @posts = Post.by_author(params[:author])
    elsif !params[:date].blank?
      if params[:date] == "Today"
      @posts = Post.from_today
      else
      @posts = Post.old_news
      end
    else
      @posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >= '2018-06-30 00:00:00.000000')